taskt/Core/Automation/Commands/UIAutomationGroup/ADescendantsSearchUIElementsFromWindowNameByTreeWalkerCommands.puml
@startuml
ADescendantsSearchUIElementsFromWindowNameByTreeWalkerCommands --> ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands
ADescendantsSearchUIElementsFromWindowNameByTreeWalkerCommands --> IOneWindowNameProperties
ADescendantsSearchUIElementsFromWindowNameByTreeWalkerCommands --> IUIElementSearchUIElementFromWindowSomethingByAnywayProperties
ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands --> AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands
ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands --> IUIElementDescendantsSearchParametersProperties
AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands --> ScriptCommand
AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands --> IUIElementChildrenSearchParametersProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
